Revit 2027 API
AnalyticalToPhysicalAssociationManager.EnableAssistedAssociation Property
 Indicates if associations between Analytical and Physical Elements should be created automatically.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool EnableAssistedAssociation { get; set; }
Public Shared Property EnableAssistedAssociation As Boolean
	Get
	Set
public:
static property bool EnableAssistedAssociation {
	bool get ();
	void set (bool value);
}
static member EnableAssistedAssociation : bool with get, set
Property Value
Boolean
Remarks
 If this flag is set to true, the associations are made on creation of an analytical element over a physical element. If it's set to false, then the associations between analytical and physical elements have to be made manually.
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace